# **Super Store**

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('SampleSuperstore.csv')
df.head()

,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,Sub-Category,Sales,Quantity,Discount,Profit
0,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,261.9600,2,0.00,41.9136
1,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,731.9400,3,0.00,219.5820
2,Second Class,Corporate,United States,Los Angeles,California,90036,West,Office Supplies,Labels,14.6200,2,0.00,6.8714
3,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Furniture,Tables,957.5775,5,0.45,-383.0310
4,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Office Supplies,Storage,22.3680,2,0.20,2.5164

In [4]:
df.columns

Index(['Ship Mode', 'Segment', 'Country', 'City', 'State', 'Postal Code',
       'Region', 'Category', 'Sub-Category', 'Sales', 'Quantity', 'Discount',
       'Profit'],
      dtype='object')

### Total amount of sales

In [5]:
sales = df['Sales'].sum().round(2)
print('Total amount of sales is ',sales)

Total amount of sales is  2297199.86

### Relationship between sales and profit

In [6]:
print('Profit percentage in each sale')
pd.DataFrame((df['Profit'] / df['Sales']) * 100).head()

Profit percentage in each sale

       0
0  16.00
1  30.00
2  47.00
3 -40.00
4  11.25

### Relationship between category and sales

In [7]:
pd.DataFrame(df.groupby('Category')['Sales'].sum())

                       Sales
Category
Furniture        741998.7953
Office Supplies  719047.0320
Technology       836154.0330

### Relationship between category and profit

In [8]:
pd.DataFrame(df.groupby('Category')['Profit'].sum())

                      Profit
Category
Furniture         18451.2728
Office Supplies  122490.8008
Technology       145451.9773

### Relationship between sales and city

In [9]:
pd.DataFrame(df.groupby('City')['Sales'].sum().sort_values(ascending=False)).head()

                    Sales
City
New York City  256368.161
Los Angeles    175851.341
Seattle        119540.742
San Francisco  112669.092
Philadelphia   109077.013